Revit 2027 API
ParameterTypeId.ViewportAttrShowExtensionLine Property
 "Show Extension Line"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewportAttrShowExtensionLine { get; }
Public Shared ReadOnly Property ViewportAttrShowExtensionLine As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewportAttrShowExtensionLine {
	ForgeTypeId^ get ();
}
static member ViewportAttrShowExtensionLine : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace